In [17]:
import pandas as pd

In [3]:
ratings_df = pd.read_csv('./data/ratings.csv')
movies_df = pd.read_csv('./data/movies.csv')

In [4]:
ratings_df.describe()

              userId        movieId         rating     timestamp
count  100836.000000  100836.000000  100836.000000  1.008360e+05
mean      326.127564   19435.295718       3.501557  1.205946e+09
std       182.618491   35530.987199       1.042529  2.162610e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.019124e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8122.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09

In [5]:
ratings_df.shape

(100836, 4)

In [6]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [7]:
def check_nan_percent(df):
    columns_null_count = df.isnull().sum()
    null_percent_df = pd.DataFrame({'null_percent': (columns_null_count/df.shape[0])*100, 'total_null': columns_null_count})
    return null_percent_df[null_percent_df.null_percent>0]

In [8]:
check_nan_percent(ratings_df)

Empty DataFrame
Columns: [null_percent, total_null]
Index: []

In [9]:
check_nan_percent(movies_df)

Empty DataFrame
Columns: [null_percent, total_null]
Index: []

## Check to see if the same user rated the same movie more than one time

In [10]:
grouped_data = ratings_df.groupby(['movieId', 'userId']).size().reset_index(name='count')
filtered_data = grouped_data[grouped_data['count'] > 1]

print(len(filtered_data))

0

In [11]:
grouped_data.head()

   movieId  userId  count
0        1       1      1
1        1       5      1
2        1       7      1
3        1      15      1
4        1      17      1

## Remember to check the uniqueness of movie titles with respect to Id in the movies_df

In [12]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [13]:
print(len(movies_df['title'].unique()))
print(len(movies_df['movieId'].unique()))

9737
9742

In [14]:
grouped_by_title = movies_df.groupby('title').size().reset_index(name='count')
filtered_movies = grouped_by_title[grouped_by_title['count'] > 1]

filtered_movies

                                       title  count
1939  Confessions of a Dangerous Mind (2002)      2
2723                             Emma (1996)      2
2785                             Eros (2004)      2
7393                         Saturn 3 (1980)      2
9287                War of the Worlds (2005)      2

In [16]:
test_data = movies_df[movies_df['title'].isin(filtered_movies['title'])]

sorted_movies = test_data.sort_values(by='title')

counts = ratings_df['movieId'].value_counts()

sorted_movies['the_count'] = sorted_movies['movieId'].map(counts)

sorted_movies

,movieId,title,genres,the_count
4169,6003,Confessions of a Dangerous Mind (2002),Comedy|Crime|Drama|Thriller,15
9106,144606,Confessions of a Dangerous Mind (2002),Comedy|Crime|Drama|Romance|Thriller,1
650,838,Emma (1996),Comedy|Drama|Romance,30
5601,26958,Emma (1996),Romance,1
5854,32600,Eros (2004),Drama,1
9135,147002,Eros (2004),Drama|Romance,1
2141,2851,Saturn 3 (1980),Adventure|Sci-Fi|Thriller,4
9468,168358,Saturn 3 (1980),Sci-Fi|Thriller,1
5931,34048,War of the Worlds (2005),Action|Adventure|Sci-Fi|Thriller,50
6932,64997,War of the Worlds (2005),Action|Sci-Fi,2

## CHECK FOR THE DISTRIBUTIONS IN RATINGS, USERID, MOVIEID